using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Logic_operation
{
    class Program
    {
        static void Main(string[] args)
        {
            // /-целое от деления, %-остатток от деления


            /*
            1) логические
    & (умножение)
        побитово умножает
    | (сложение)
        побитовое сложение
    ^ (исключающее или, XOR)

        побитовое сравнение(если одинаковы -0, если различаются, то 1)
	~(отрицание / инверcия)

        побитово все 0 заменяются на 1, а 1 на 0(ВАЖНО!заменяет все биты сожержащиеся в переменной)
2) Операции сдвига

    >> (сдвиг вправо) -отсекаем байты
    << (сдивг влево) -добавляем 0


            | - или
            & - и
            || - или
            && - и
            ^ - возвращает тру только если один false а второй true
    */
        }
    }
}
